[
    {
        "id": 1,
        "title": "Système Feedback",
        "description": "Projet collaboratif réalisé en équipe, visant à développer une plateforme de feedback pour une école. L'application permet aux élèves ainsi qu'au personnel de partager leurs avis et suggestions de manière centralisée. Ce projet a permis de mettre en place un système complet de gestion des retours, avec une base de données solide et une interface utilisateur intuitive. Le travail d'équipe a été essentiel et nous avons mené le projet jusqu'à son aboutissement avec succès.",
        "image": "images/feedback.png",
        "type": "projet",
        "link": "projet.html?id=1",
        "stack": [
            "HTML",
            "CSS",
            "PHP",
            "MySQL"
        ]
    },
    {
        "id": 2,
        "title": "Création d'affiches",
        "description": "Réalisation de plusieurs affiches visuelles pour des clients, dont cette affiche festive, pour la Saint-Valentin et pour mettre en avant une boutique de bijoux et cadeaux. Chaque création visait à refléter l’identité de l'identité du client et le style en fonction de l'occasion associé, tout en respectant les contraintes de communication visuelle et de diffusion. Ce projet a permis de développer un sens aiguisé de la composition graphique et de l’harmonisation des couleurs.",
        "image": "images/Aury Empire.jpg",
        "type": "projet",
        "link": "projet.html?id=2",
        "stack": [
            "Illustrator"
        ]
    },
    {
        "id": 3,
        "title": "Click and Cook",
        "description": "Click and Cook est une application web qui permet de rechercher et de proposer des recettes en fonction des ingrédients disponibles chez l’utilisateur. L’application fournit des suggestions adaptées, gère les comptes utilisateurs avec authentification et utilise une base de données pour stocker les recettes et leurs informations. Son interface moderne et intuitive facilite la planification des repas tout en optimisant le temps et les ressources disponibles.",
        "image": "images/clickandcook.png",
        "type": "projet",
        "link": "projet.html?id=3",
        "stack": [
            "HTML",
            "Tailwind CSS",
            "JavaScript",
            "Supabase"
        ]
    }, 
    {
        "id": 4,
        "title": "Portfolio",
        "description": "Développement d'un portfolio personnel pour présenter mes compétences, projets et expériences professionnelles. Le site est conçu pour être à la fois esthétique et fonctionnel, avec une navigation fluide et une mise en page responsive. Ce projet m'a permis de mettre en pratique mes compétences en développement web tout en créant une vitrine professionnelle pour attirer de potentiels employeurs ou clients.",
        "image": "images/portfolio.png",
        "type": "projet",
        "link": "projet.html?id=4",
        "stack": [
            "HTML",
            "CSS",
            "JavaScript"
        ]
    }, 
    {
        "id": 5,
        "title": "Projet scolaire Application pour une bijouterie",
        "description": "Application de gestion pour un atelier de bijouterie permettant aux chefs d’atelier et aux opérateurs (fondeurs, sertisseurs, polisseurs) de suivre chaque étape de la création et réparation des bijoux. Le projet utilise HTML et CSS pour la structure et le design des interfaces, JavaScript pour les interactions dynamiques, PHP et MySQL pour la gestion back-end et la base de données. L’application inclut la gestion des matériaux, l’ajout de commentaires et d’images, l’attribution des tâches, ainsi que la vérification de la qualité, offrant un suivi collaboratif et efficace des projets.",
        "image": "images/bijouterie.png",
        "type": "projet",
        "link": "projet.html?id=5",
        "stack": [
            "HTML",
            "CSS",
            "JavaScript",
            "PHP",
            "MySQL"
        ]
    },
    {
        "id": 6,
        "title": "Projet scolaire Music Art - Cours de musique en ligne",
        "description": "Site web de cours de musique en ligne permettant à tout âge et tout niveau d'apprendre un instrument ou le chant. Le projet utilise HTML et CSS pour la structure et la mise en page, ainsi que JavaScript pour les interactions dynamiques. Le site présente des informations sur la musique, des témoignages d'élèves, un formulaire de contact, et met en avant les avantages de l'apprentissage musical avec des professionnels passionnés.",
        "image": "images/Musique.png",
        "type": "projet",
        "link": "projet.html?id=6",
        "stack": [
            "HTML",
            "CSS"
            
        ]
    },
    {
        "id": 7,
        "title": "Projet scolaire Workshop - Agent Secret",
        "description": "Workshop Agent Secret est un projet réalisé en équipe à l’EPSI. Nous avons conçu une caméra connectée avec un ESP32-CAM, alimentée par une batterie externe et accessible à distance via Wi-Fi grâce à son adresse IP. Un bouton physique déclenchait un script Python qui lançait automatiquement l’enregistrement vidéo. Ce projet m’a permis de développer des compétences en Python, IoT, communication réseau et travail collaboratif.",
        "image": "images/esp.jpg",
        "type": "projet",
        "link": "projet.html?id=7",
        "stack": [
            "Python (Open CV, Pip, GPIO)",
            "Arduino"
        ]
    },
{
    "id": 8,
    "title": "Projet scolaire Zootopia - Application de gestion d'un zoo",
    "description": "Zootopia est une application web développée dans le cadre d'un projet scolaire. Elle permet de gérer l'ensemble d'un zoo, incluant les animaux, les enclos et les espaces. L'application offre une interface complète pour ajouter, modifier et suivre les informations des animaux, tout en respectant des contraintes de gestion comme la capacité maximale des enclos ou les validations d'identifiants uniques. Développée avec Symfony, PHP et MySQL, elle utilise Twig pour le rendu des pages et respecte les bonnes pratiques MVC.",
    "image": "images/zootopia.png",
    "type": "projet",
    "link": "projet.html?id=8",
    "stack": [
        "Symfony",
        "PHP",
        "MySQL",
        "HTML",
        "CSS",
        "Twig"
    ]
}


]